app/controllers/users_controller.rb

  def microposts
    @microposts = @user.microposts.first
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]